add report of usecase
